app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"
---
  def index
    if params[:author_id]
      @posts = Author.find(params[:author_id]).posts
      #*check for params, find posts under authors id
    else
      @posts = Post.all